###################################################################

# Created by write_sdc on Tue Apr 16 15:20:24 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_driving_cell -lib_cell INVX1 [get_ports clk]
set_driving_cell -lib_cell INVX1 [get_ports reset]
set_driving_cell -lib_cell INVX1 [get_ports we]
set_driving_cell -lib_cell INVX1 [get_ports {d[15]}]
set_driving_cell -lib_cell INVX1 [get_ports {d[14]}]
set_driving_cell -lib_cell INVX1 [get_ports {d[13]}]
set_driving_cell -lib_cell INVX1 [get_ports {d[12]}]
set_driving_cell -lib_cell INVX1 [get_ports {d[11]}]
set_driving_cell -lib_cell INVX1 [get_ports {d[10]}]
set_driving_cell -lib_cell INVX1 [get_ports {d[9]}]
set_driving_cell -lib_cell INVX1 [get_ports {d[8]}]
set_driving_cell -lib_cell INVX1 [get_ports {d[7]}]
set_driving_cell -lib_cell INVX1 [get_ports {d[6]}]
set_driving_cell -lib_cell INVX1 [get_ports {d[5]}]
set_driving_cell -lib_cell INVX1 [get_ports {d[4]}]
set_driving_cell -lib_cell INVX1 [get_ports {d[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {d[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {d[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {d[0]}]
create_clock [get_ports clk]  -period 1  -waveform {0 0.5}
set_input_delay -clock clk  0.1  [get_ports reset]
set_input_delay -clock clk  0.1  [get_ports we]
set_input_delay -clock clk  0.1  [get_ports {d[15]}]
set_input_delay -clock clk  0.1  [get_ports {d[14]}]
set_input_delay -clock clk  0.1  [get_ports {d[13]}]
set_input_delay -clock clk  0.1  [get_ports {d[12]}]
set_input_delay -clock clk  0.1  [get_ports {d[11]}]
set_input_delay -clock clk  0.1  [get_ports {d[10]}]
set_input_delay -clock clk  0.1  [get_ports {d[9]}]
set_input_delay -clock clk  0.1  [get_ports {d[8]}]
set_input_delay -clock clk  0.1  [get_ports {d[7]}]
set_input_delay -clock clk  0.1  [get_ports {d[6]}]
set_input_delay -clock clk  0.1  [get_ports {d[5]}]
set_input_delay -clock clk  0.1  [get_ports {d[4]}]
set_input_delay -clock clk  0.1  [get_ports {d[3]}]
set_input_delay -clock clk  0.1  [get_ports {d[2]}]
set_input_delay -clock clk  0.1  [get_ports {d[1]}]
set_input_delay -clock clk  0.1  [get_ports {d[0]}]
set_output_delay -clock clk  0.1  [get_ports {q[15]}]
set_output_delay -clock clk  0.1  [get_ports {q[14]}]
set_output_delay -clock clk  0.1  [get_ports {q[13]}]
set_output_delay -clock clk  0.1  [get_ports {q[12]}]
set_output_delay -clock clk  0.1  [get_ports {q[11]}]
set_output_delay -clock clk  0.1  [get_ports {q[10]}]
set_output_delay -clock clk  0.1  [get_ports {q[9]}]
set_output_delay -clock clk  0.1  [get_ports {q[8]}]
set_output_delay -clock clk  0.1  [get_ports {q[7]}]
set_output_delay -clock clk  0.1  [get_ports {q[6]}]
set_output_delay -clock clk  0.1  [get_ports {q[5]}]
set_output_delay -clock clk  0.1  [get_ports {q[4]}]
set_output_delay -clock clk  0.1  [get_ports {q[3]}]
set_output_delay -clock clk  0.1  [get_ports {q[2]}]
set_output_delay -clock clk  0.1  [get_ports {q[1]}]
set_output_delay -clock clk  0.1  [get_ports {q[0]}]
