###################################################################

# Created by write_sdc on Tue Apr 16 13:20:16 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_driving_cell -lib_cell INVX1 [get_ports clk]
set_driving_cell -lib_cell INVX1 [get_ports reset]
set_driving_cell -lib_cell INVX1 [get_ports {ctrl[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {ctrl[0]}]
set_driving_cell -lib_cell INVX1 [get_ports {a[15]}]
set_driving_cell -lib_cell INVX1 [get_ports {a[14]}]
set_driving_cell -lib_cell INVX1 [get_ports {a[13]}]
set_driving_cell -lib_cell INVX1 [get_ports {a[12]}]
set_driving_cell -lib_cell INVX1 [get_ports {a[11]}]
set_driving_cell -lib_cell INVX1 [get_ports {a[10]}]
set_driving_cell -lib_cell INVX1 [get_ports {a[9]}]
set_driving_cell -lib_cell INVX1 [get_ports {a[8]}]
set_driving_cell -lib_cell INVX1 [get_ports {a[7]}]
set_driving_cell -lib_cell INVX1 [get_ports {a[6]}]
set_driving_cell -lib_cell INVX1 [get_ports {a[5]}]
set_driving_cell -lib_cell INVX1 [get_ports {a[4]}]
set_driving_cell -lib_cell INVX1 [get_ports {a[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {a[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {a[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {a[0]}]
set_driving_cell -lib_cell INVX1 [get_ports {b[15]}]
set_driving_cell -lib_cell INVX1 [get_ports {b[14]}]
set_driving_cell -lib_cell INVX1 [get_ports {b[13]}]
set_driving_cell -lib_cell INVX1 [get_ports {b[12]}]
set_driving_cell -lib_cell INVX1 [get_ports {b[11]}]
set_driving_cell -lib_cell INVX1 [get_ports {b[10]}]
set_driving_cell -lib_cell INVX1 [get_ports {b[9]}]
set_driving_cell -lib_cell INVX1 [get_ports {b[8]}]
set_driving_cell -lib_cell INVX1 [get_ports {b[7]}]
set_driving_cell -lib_cell INVX1 [get_ports {b[6]}]
set_driving_cell -lib_cell INVX1 [get_ports {b[5]}]
set_driving_cell -lib_cell INVX1 [get_ports {b[4]}]
set_driving_cell -lib_cell INVX1 [get_ports {b[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {b[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {b[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {b[0]}]
create_clock [get_ports clk]  -period 1  -waveform {0 0.5}
set_input_delay -clock clk  0.1  [get_ports reset]
set_input_delay -clock clk  0.1  [get_ports {ctrl[1]}]
set_input_delay -clock clk  0.1  [get_ports {ctrl[0]}]
set_input_delay -clock clk  0.1  [get_ports {a[15]}]
set_input_delay -clock clk  0.1  [get_ports {a[14]}]
set_input_delay -clock clk  0.1  [get_ports {a[13]}]
set_input_delay -clock clk  0.1  [get_ports {a[12]}]
set_input_delay -clock clk  0.1  [get_ports {a[11]}]
set_input_delay -clock clk  0.1  [get_ports {a[10]}]
set_input_delay -clock clk  0.1  [get_ports {a[9]}]
set_input_delay -clock clk  0.1  [get_ports {a[8]}]
set_input_delay -clock clk  0.1  [get_ports {a[7]}]
set_input_delay -clock clk  0.1  [get_ports {a[6]}]
set_input_delay -clock clk  0.1  [get_ports {a[5]}]
set_input_delay -clock clk  0.1  [get_ports {a[4]}]
set_input_delay -clock clk  0.1  [get_ports {a[3]}]
set_input_delay -clock clk  0.1  [get_ports {a[2]}]
set_input_delay -clock clk  0.1  [get_ports {a[1]}]
set_input_delay -clock clk  0.1  [get_ports {a[0]}]
set_input_delay -clock clk  0.1  [get_ports {b[15]}]
set_input_delay -clock clk  0.1  [get_ports {b[14]}]
set_input_delay -clock clk  0.1  [get_ports {b[13]}]
set_input_delay -clock clk  0.1  [get_ports {b[12]}]
set_input_delay -clock clk  0.1  [get_ports {b[11]}]
set_input_delay -clock clk  0.1  [get_ports {b[10]}]
set_input_delay -clock clk  0.1  [get_ports {b[9]}]
set_input_delay -clock clk  0.1  [get_ports {b[8]}]
set_input_delay -clock clk  0.1  [get_ports {b[7]}]
set_input_delay -clock clk  0.1  [get_ports {b[6]}]
set_input_delay -clock clk  0.1  [get_ports {b[5]}]
set_input_delay -clock clk  0.1  [get_ports {b[4]}]
set_input_delay -clock clk  0.1  [get_ports {b[3]}]
set_input_delay -clock clk  0.1  [get_ports {b[2]}]
set_input_delay -clock clk  0.1  [get_ports {b[1]}]
set_input_delay -clock clk  0.1  [get_ports {b[0]}]
set_output_delay -clock clk  0.1  [get_ports {out[31]}]
set_output_delay -clock clk  0.1  [get_ports {out[30]}]
set_output_delay -clock clk  0.1  [get_ports {out[29]}]
set_output_delay -clock clk  0.1  [get_ports {out[28]}]
set_output_delay -clock clk  0.1  [get_ports {out[27]}]
set_output_delay -clock clk  0.1  [get_ports {out[26]}]
set_output_delay -clock clk  0.1  [get_ports {out[25]}]
set_output_delay -clock clk  0.1  [get_ports {out[24]}]
set_output_delay -clock clk  0.1  [get_ports {out[23]}]
set_output_delay -clock clk  0.1  [get_ports {out[22]}]
set_output_delay -clock clk  0.1  [get_ports {out[21]}]
set_output_delay -clock clk  0.1  [get_ports {out[20]}]
set_output_delay -clock clk  0.1  [get_ports {out[19]}]
set_output_delay -clock clk  0.1  [get_ports {out[18]}]
set_output_delay -clock clk  0.1  [get_ports {out[17]}]
set_output_delay -clock clk  0.1  [get_ports {out[16]}]
set_output_delay -clock clk  0.1  [get_ports {out[15]}]
set_output_delay -clock clk  0.1  [get_ports {out[14]}]
set_output_delay -clock clk  0.1  [get_ports {out[13]}]
set_output_delay -clock clk  0.1  [get_ports {out[12]}]
set_output_delay -clock clk  0.1  [get_ports {out[11]}]
set_output_delay -clock clk  0.1  [get_ports {out[10]}]
set_output_delay -clock clk  0.1  [get_ports {out[9]}]
set_output_delay -clock clk  0.1  [get_ports {out[8]}]
set_output_delay -clock clk  0.1  [get_ports {out[7]}]
set_output_delay -clock clk  0.1  [get_ports {out[6]}]
set_output_delay -clock clk  0.1  [get_ports {out[5]}]
set_output_delay -clock clk  0.1  [get_ports {out[4]}]
set_output_delay -clock clk  0.1  [get_ports {out[3]}]
set_output_delay -clock clk  0.1  [get_ports {out[2]}]
set_output_delay -clock clk  0.1  [get_ports {out[1]}]
set_output_delay -clock clk  0.1  [get_ports {out[0]}]
